app/controllers/actors_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def index
  @movie = Movie.find(params[:movie_id])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
def show
  @Actor = Actor.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "actors".* FROM "actors" INNER JOIN "actors_movies" ON "actors"."id" = "actors_movies"."actor_id" WHERE "actors_movies"."movie_id" = $1  [["movie_id", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "actors_movies" ON "movies"."id" = "actors_movies"."movie_id" WHERE "actors_movies"."actor_id" = $1  [["actor_id", 1]]
SELECT  1 AS one FROM "actors" INNER JOIN "actors_movies" ON "actors"."id" = "actors_movies"."actor_id" WHERE "actors_movies"."movie_id" = $1 AND "actors"."id" = $2 LIMIT $3  [["movie_id", 1], ["id", 2], ["LIMIT", 1]]
---
def show
  @movie = Movie.find(params[:movie_id])
  @actor = Actor.find(params[:id])

  if @movie.actors.include?(@actor)