app/controllers/movies_controller.rb

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @actor = Actor.find(params[:actor_id])

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "actors_movies" ON "movies"."id" = "actors_movies"."movie_id" WHERE "actors_movies"."actor_id" = $1  [["actor_id", 1]]
SELECT "actors".* FROM "actors" INNER JOIN "actors_movies" ON "actors"."id" = "actors_movies"."actor_id" WHERE "actors_movies"."movie_id" = $1  [["movie_id", 1]]
SELECT  1 AS one FROM "movies" INNER JOIN "actors_movies" ON "movies"."id" = "actors_movies"."movie_id" WHERE "actors_movies"."actor_id" = $1 AND "movies"."id" = $2 LIMIT $3  [["actor_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @actor = Actor.find(params[:actor_id])
    @movie = Movie.find(params[:id])

    if @actor.movies.include?(@movie)